{
  "add_prefix_space": false,
  "backend": "tokenizers",
  "bos_token": "<s>",
  "cls_token": "<s>",
  "eos_token": "</s>",
  "errors": "replace",
  "extra_special_tokens": [
    "<PI3K_ALPHA>",
    "<PI3K_BETA>",
    "<PI3K_DELTA>",
    "<PI3K_GAMMA>",
    "<HIGH_PIC50>",
    "<LOW_PIC50>",
    "<GOOD_ADMET>",
    "<BAD_ADMET>"
  ],
  "full_tokenizer_file": null,
  "is_local": false,
  "local_files_only": false,
  "mask_token": "<mask>",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "<pad>",
  "sep_token": "</s>",
  "tokenizer_class": "RobertaTokenizer",
  "trim_offsets": true,
  "unk_token": "<unk>"
}
